<a href="https://colab.research.google.com/github/Adaline-K/git4-collaboration-sourcetree/blob/master/data_test03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas 패키지**

판다스(Pandas)패키지를 사용하여 데이터를 분석하는 방법 알기 

-시리즈와 데이터프레임을 만듦

-판다스를 이용하여 csv 파일을 읽고 쓸 수 있다.

-시리즈와 데이터프레임에서 원하는 데이터를 읽고 갱신하는 방법을 익힌다.

-시리즈와 데이터프레임의 데이터를 조작하는 법을 공부한다.

-멀티 인덱스와 이를 다루는 방법을 학습한다.

--둘 이상의 데이터프레임을 하나로 합치는 법을 익힌다.

-데이터를 그룹으로 나누어 분석하고 피봇테이블을 만드는 방법을 공부한다.

In [ ]:
import pandas as pd

s=pd.Series([904312, 3448737, 2890451, 2466052],
            index=["서울","부산","인천", "대구"])
print(s)
print(s.index)
print(s.values)
print()
t=pd.Series(range(10, 14))
print(t)
print(t.index)
print(t.values)

서울     904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
Index(['서울', '부산', '인천', '대구'], dtype='object')
[ 904312 3448737 2890451 2466052]

0    10
1    11
2    12
3    13
dtype: int64
RangeIndex(start=0, stop=4, step=1)
[10 11 12 13]

In [ ]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [ ]:
print(s[1],s["부산"])
print(s[3],s["대구"])
print(s[[0,3,1]])
print(s[["서울","대구","부산"]])

3448737 3448737
2466052 2466052
서울     904312
대구    2466052
부산    3448737
dtype: int64
서울     904312
대구    2466052
부산    3448737
dtype: int64

In [ ]:
s0=pd.Series(range(3), index=["a","b","c"])
print(s0)
print(s0.a)
print(s0.b)
print(s0.c)

a    0
b    1
c    2
dtype: int64
0
1
2

In [ ]:
"서울" in s

for k, v in s.items():
  print("%s= %d" %(k,v))

서울= 904312
부산= 3448737
인천= 2890451
대구= 2466052

In [ ]:
s2= pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2635035, "대전": 1490158 })
s2

서울    9631482
부산    3393191
인천    2635035
대전    1490158
dtype: int64

In [ ]:
ds=s-s2
print(ds)

print(s.values - s2.values)

대구          NaN
대전          NaN
부산      55546.0
서울   -8727170.0
인천     255416.0
dtype: float64
[-8727170    55546   255416   975894]

In [ ]:
rs=(s-s2)/s2*100
rs=rs[rs.notnull()]
rs

부산     1.636984
서울   -90.610874
인천     9.693078
dtype: float64

In [ ]:
rs["부산"]=1.63
print(rs)

del rs["부산"]
print(rs)

부산     1.630000
서울   -90.610874
인천     9.693078
dtype: float64
서울   -90.610874
인천     9.693078
dtype: float64

In [ ]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]

df=pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [ ]:
print(df.values)
print()
print(df.index)

[['수도권' 9904312 9631482 9762546 9853972 0.0283]
 ['경상권' 3448737 3393191 3512547 3655437 0.0163]
 ['수도권' 2890451 2632035 2517680 2466338 0.0982]
 ['경상권' 2466052 2431774 2456016 2473990 0.0141]]

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [ ]:
df.index.name="도시"
df.columns.name="특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [ ]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [ ]:
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [ ]:
df[["2010", "2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [ ]:
df[1:2]
df["2015"]["서울"]

9904312

In [ ]:
%%writefile sample1.csv
c1,c2,c3
1,1.11, one
2,2.22, two
3,3.33, three

Writing sample1.csv

In [ ]:
pd.read_csv('sample1.csv',names=['c1','c2','c3'])

   c1    c2      c3
0  c1    c2      c3
1   1  1.11     one
2   2  2.22     two
3   3  3.33   three

In [ ]:
pd.read_csv('sample1.csv',index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [ ]:
%%writefile sample3.txt
c1    c2   c3    c4
0.17 -1.53 1.34 9.43
1.02 0.08 -1.28 0.49
0.417 -2.02 0.25 -1.10

Writing sample3.txt

In [ ]:
pd.read_table('sample3.txt', sep='\s+')

      c1    c2    c3    c4
0  0.170 -1.53  1.34  9.43
1  1.020  0.08 -1.28  0.49
2  0.417 -2.02  0.25 -1.10

In [ ]:
%%writefile sample4.txt
파일제목:sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1,1.11, one
2, 2.22, two 
3, 3.33, three

Writing sample4.txt

In [ ]:
pd.read_csv('sample4.txt', skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22    two
2   3  3.33   three

In [ ]:
df.to_csv('sample6.csv')
pd.read_csv('sample6.csv')

   도시   지역     2015     2010     2005     2000  2010-2015 증가율
0  서울  수도권  9904312  9631482  9762546  9853972         0.0283
1  부산  경상권  3448737  3393191  3512547  3655437         0.0163
2  인천  수도권  2890451  2632035  2517680  2466338         0.0982
3  대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [ ]:
df=pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")
df.head()
df.tail(2)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[2 rows x 12 columns]

In [ ]:
import datetime
dt_start = datetime.datetime(2015, 1, 1)
dt_end = "2016, 6, 30"

In [ ]:
import numpy as np
dff= pd.DataFrame(np.arange(10,22).reshape(3,4),
                  index=['a','b','c'],
                  columns=['A','B','C','D'])
dff

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [ ]:
print(dff.loc["a"])
print()
print(dff.loc["b":"c"])
print()
print(dff["b":"c"])

A    10
B    11
C    12
D    13
Name: a, dtype: int64

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [ ]:
print(dff.A>15)
print()
dff.loc[dff.A>15]

a    False
b    False
c     True
Name: A, dtype: bool

    A   B   C   D
c  18  19  20  21

In [ ]:
df3=pd.DataFrame(np.arange(10,26).reshape(4,4), columns=["A","B","C","D"])
df3

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [ ]:
df3.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [ ]:

print(dff.loc["b":"A"])

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [ ]:
dff.iloc[2:3, 1:3]

    B   C
c  19  20

In [ ]:
dff.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int64

In [ ]:
dff.iloc[-1]=dff.iloc[-1]*2
dff

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

In [ ]:
se=pd.Series(range(10))
se[3]=np.nan
se

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [ ]:
se.count()

9

In [ ]:
#데이터프레임의 데이터 조작
#판다스는 넘파이 2차원 배열에서 가능한 대부분의 데이터 처리가 가능하며 추가로 데이터 처리 및 변환을 위한 다양한 함수와 매서드를 제공한다.

e=pd.Series(range(10))
e[3]=np.nan
e

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [ ]:
np.random.seed(2)
r=pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
r.iloc[2,3]=np.nan
print(r)
print()
r.count()

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

0    4
1    4
2    4
3    3
dtype: int64

In [ ]:
import seaborn as sns
titanic=sns.load_dataset("titanic")
titanic.head()
titanic.tail()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[5 rows x 15 columns]

In [ ]:
np.random.seed(1)
s2=pd.Series(np.random.randint(6, size=100))
print(s2.tail())
print(s2.value_counts())

95    4
96    5
97    2
98    4
99    3
dtype: int64
1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [ ]:
#정렬 sort_index, sort_values
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [ ]:
e.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [ ]:
e.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [ ]:
print(r)
print()
print(r.sort_values(by=1))
print()
print(r.sort_values(by=[1,2]))

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [ ]:
#행/열 합계
np.random.seed(1)
r2=pd.DataFrame(np.random.randint(10, size=(4,8)))
r2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [ ]:
#행합계
r2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [ ]:
r2["행합계"]=r2.sum(axis=1)
r2

   0  1  2  3  4  5  6  7  행합계
0  5  8  9  5  0  0  1  7   35
1  6  9  2  4  5  2  4  2   34
2  4  7  7  9  1  7  0  6   41
3  9  9  7  6  9  1  0  1   42

In [ ]:
#열합계
r2.sum()

0       24
1       33
2       25
3       24
4       15
5       10
6        5
7       16
행합계    152
dtype: int64

In [ ]:
r2.loc["ColTotal", :]= r2.sum()
r2

             0     1     2     3     4     5    6     7    행합계
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0   35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0   34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0   41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0   42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0  152.0

In [ ]:
#apply변환(행이나 열단위로 더 복잡한 처리를 하고 싶을때 apply mehtod 사용)
r3=pd.DataFrame({
    'A':[1,3,4,3,4],
    'B':[2,3,1,2,3],
    'C':[1,5,2,4,4]
})

r3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [ ]:
#각열의 최대값과 최소값의 차이를 구함
r3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [ ]:
r3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [ ]:
#astype 메서드로 전체 데이터의 자료
r3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [ ]:
ages=[0,2,10,21,23,37,31,61,20,41,32,101]
bins=[1,20,30,50,70,100]
labels=["미성년자", "청년","중년", "장년", "노년"]
cats=pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [ ]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [ ]:
r4=pd.DataFrame(ages, columns=["ages"])
r4["age_cat"]=pd.cut(r4.ages, bins, labels=labels)
r4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   101     NaN

In [ ]:
r4.age_cat.astype(str)+r4.ages.astype(str)

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       중년37
6       중년31
7       장년61
8     미성년자20
9       중년41
10      중년32
11    nan101
dtype: object

In [ ]:
data=np.random.randn(1000)
cats=pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q2', 'Q1', 'Q2', 'Q3', 'Q1', ..., 'Q1', 'Q1', 'Q4', 'Q4', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [ ]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64

In [ ]:
#데이터프레임 인덱스 설정 및 제거
np.random.seed(0)
rr=pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3,5),2)]).T,
                           columns=["C1","C2","C3","C4"])
rr

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [ ]:
rr2=rr.set_index("C1")
rr2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [ ]:
rr2.set_index("C2")

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [ ]:
rr2.reset_index(drop=True)

     C2    C3    C4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

In [ ]:
#다중인덱스
np.random.seed(0)
rr3=pd.DataFrame(np.round(np.random.randn(5,4),2),
                 columns=[["A","A","B","B"],
                          ["C1","C2","C1","C2"]])
rr3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [ ]:
rr3.columns.names=["Cidx1", "Cidx2"]
rr3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [ ]:
#다중인덱스
np.random.seed(0)
rr4=pd.DataFrame(np.round(np.random.randn(6,4),2),
                 columns=[["A","A","B","B"],
                          ["C","D","C","D"]],
                          index=[["M","M","M","F","F","F"],
                                 ["id_" +str(i+1) for i in range(3)]*2])
rr4.columns.names=["Cidx1","Cidx2"]
rr4.index.names=["Ridx1", "Ridx2"]
rr4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [ ]:
#행인덱스와 열인덱스 교환
rr4.stack("Cidx1")

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

In [ ]:
rr4.stack(1)

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      1.76  0.98
            D      0.40  2.24
      id_2  C      1.87  0.95
            D     -0.98 -0.15
      id_3  C     -0.10  0.14
            D      0.41  1.45
F     id_1  C      0.76  0.44
            D      0.12  0.33
      id_2  C      1.49  0.31
            D     -0.21 -0.85
      id_3  C     -2.55  0.86
            D      0.65 -0.74

In [ ]:
rr4.unstack("Ridx2")

Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.76  1.49 -2.55  0.12 -0.21  0.65  0.44  0.31  0.86  0.33 -0.85 -0.74
M      1.76  1.87 -0.10  0.40 -0.98  0.41  0.98  0.95  0.14  2.24 -0.15  1.45

In [ ]:
rr4.unstack(0)

Cidx1     A                       B
Cidx2     C           D           C           D
Ridx1     F     M     F     M     F     M     F     M
Ridx2
id_1   0.76  1.76  0.12  0.40  0.44  0.98  0.33  2.24
id_2   1.49  1.87 -0.21 -0.98  0.31  0.95 -0.85 -0.15
id_3  -2.55 -0.10  0.65  0.41  0.86  0.14 -0.74  1.45

In [ ]:
rr3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [ ]:
rr3[("B","C1")]

0    0.98
1    0.95
2    0.14
3    0.44
4    0.31
Name: (B, C1), dtype: float64

In [ ]:
rr3.loc[0,("B","C1")]

0.98

In [ ]:
rr3.loc[0,("B","C")]=100
rr3

Cidx1     A           B
Cidx2    C1    C2    C1    C2      C
0      1.76  0.40  0.98  2.24  100.0
1      1.87 -0.98  0.95 -0.15    NaN
2     -0.10  0.41  0.14  1.45    NaN
3      0.76  0.12  0.44  0.33    NaN
4      1.49 -0.21  0.31 -0.85    NaN

In [ ]:
rr3.iloc[0,2]

0.98

In [ ]:
rr4.loc[("M","id_1"),("A","C")]

1.76

In [ ]:
rr4.loc[("All","All"), :]=rr4.sum()
rr4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [ ]:
rr4.loc["M"]

Cidx1     A           B
Cidx2     C     D     C     D
Ridx2
id_1   1.76  0.40  0.98  2.24
id_2   1.87 -0.98  0.95 -0.15
id_3  -0.10  0.41  0.14  1.45

In [ ]:
rr4.loc[("M",slice(None)),:]

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45

In [ ]:
rr5=rr4.swaplevel("Ridx1","Ridx2")
rr5

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [ ]:
rr6=rr4.swaplevel("Cidx1","Cidx2",1)
rr6

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

In [ ]:
rr5.sort_index(level=0)

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
All   All    3.23  0.39  3.68  2.28
id_1  F      0.76  0.12  0.44  0.33
      M      1.76  0.40  0.98  2.24
id_2  F      1.49 -0.21  0.31 -0.85
      M      1.87 -0.98  0.95 -0.15
id_3  F     -2.55  0.65  0.86 -0.74
      M     -0.10  0.41  0.14  1.45

In [ ]:
rr6.sort_index(level=0)

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
All   All    3.23  0.39  3.68  2.28
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45

In [ ]:
rr6.sort_index(axis=1, level=0)

Cidx2           C           D
Cidx1           A     B     A     B
Ridx1 Ridx2
M     id_1   1.76  0.98  0.40  2.24
      id_2   1.87  0.95 -0.98 -0.15
      id_3  -0.10  0.14  0.41  1.45
F     id_1   0.76  0.44  0.12  0.33
      id_2   1.49  0.31 -0.21 -0.85
      id_3  -2.55  0.86  0.65 -0.74
All   All    3.23  3.68  0.39  2.28

In [ ]:
#데이터 프레임 합성
#merge함수는 두 데이터 프레임의 공통 열 혹은 인덱스를 기준으로 두개의 테이블을 합침. 이때 기준이 되는 열, 행의 데이터 Key

ddf1=pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름':['A','B','C','D','E','F','G']}, columns=['고객번호','이름'])

ddf1

   고객번호 이름
0  1001  A
1  1002  B
2  1003  C
3  1004  D
4  1005  E
5  1006  F
6  1007  G

In [ ]:
ddf2=pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액':[10000, 20000, 15000, 5000, 1000000, 30000]}, columns=['고객번호','금액'])
ddf2

   고객번호       금액
0  1001    10000
1  1001    20000
2  1005    15000
3  1006     5000
4  1008  1000000
5  1001    30000

In [ ]:
pd.merge(ddf1, ddf2)

   고객번호 이름     금액
0  1001  A  10000
1  1001  A  20000
2  1001  A  30000
3  1005  E  15000
4  1006  F   5000

In [ ]:
#outer join방식은 키 값이 한쪽에만 있어도 데이터를 보여줌
pd.merge(ddf1, ddf2, how='outer')

   고객번호   이름         금액
0  1001    A    10000.0
1  1001    A    20000.0
2  1001    A    30000.0
3  1002    B        NaN
4  1003    C        NaN
5  1004    D        NaN
6  1005    E    15000.0
7  1006    F     5000.0
8  1007    G        NaN
9  1008  NaN  1000000.0

In [ ]:
pd.merge(ddf1, ddf2, how='left')

   고객번호 이름       금액
0  1001  A  10000.0
1  1001  A  20000.0
2  1001  A  30000.0
3  1002  B      NaN
4  1003  C      NaN
5  1004  D      NaN
6  1005  E  15000.0
7  1006  F   5000.0
8  1007  G      NaN

In [ ]:
pd.merge(ddf1, ddf2, how='right')

   고객번호   이름       금액
0  1001    A    10000
1  1001    A    20000
2  1001    A    30000
3  1005    E    15000
4  1006    F     5000
5  1008  NaN  1000000

In [ ]:
ddf1= pd.DataFrame({
    '품종': ['sestosa', 'sestosa', 'virginica', 'virginica'],
    '꽃잎길이':[1.4, 1.3, 1.5, 1.3]},
    columns=['품종', '꽃잎길이'])

ddf1

          품종  꽃잎길이
0    sestosa   1.4
1    sestosa   1.3
2  virginica   1.5
3  virginica   1.3

In [ ]:
ddf2= pd.DataFrame({
    '품종': ['sestosa', 'virginica', 'virginica', 'versicolor'],
    '꽃잎너비':[0.4,0.3, 0.5, 0.3]},
    columns=['품종', '꽃잎너비'])
ddf2

           품종  꽃잎너비
0     sestosa   0.4
1   virginica   0.3
2   virginica   0.5
3  versicolor   0.3

In [ ]:
pd.merge(ddf1, ddf2)

          품종  꽃잎길이  꽃잎너비
0    sestosa   1.4   0.4
1    sestosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

In [ ]:
ddf3= pd.DataFrame({
    '고객명': ['A', 'B', 'C'],
    '날짜':['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터':['20000','30000','100000']})

ddf3

  고객명          날짜     데이터
0   A  2018-01-01   20000
1   B  2018-01-02   30000
2   C  2018-01-01  100000

In [ ]:
ddf4= pd.DataFrame({
    '고객명': ['A', 'B'],
    '데이터':['남자', '여자']})
ddf4

  고객명 데이터
0   A  남자
1   B  여자

In [ ]:
pd.merge(ddf3, ddf4, on='고객명')

  고객명          날짜  데이터_x 데이터_y
0   A  2018-01-01  20000    남자
1   B  2018-01-02  30000    여자

In [ ]:
ddf1=pd.DataFrame({
    '이름':['AA','BB','BB'],
    '성적1':[1,2,3]})
ddf1

   이름  성적1
0  AA    1
1  BB    2
2  BB    3

In [ ]:
ddf2=pd.DataFrame({
    '성명':['AA','AA','BB'],
    '성적2':[4,5,6]})
ddf2

   성명  성적2
0  AA    4
1  AA    5
2  BB    6

In [ ]:
pd.merge(ddf1, ddf2, left_on='이름', right_on="성명")

   이름  성적1  성명  성적2
0  AA    1  AA    4
1  AA    1  AA    5
2  BB    2  BB    6
3  BB    3  BB    6

In [ ]:
df1=pd.DataFrame({
    '도시':['S','S','S','B','B'],
    '연도':[2000,2005,2010,2005,2020],
    '인구':[9853000, 976000, 96000, 365500,765000]})

df1

  도시    연도       인구
0  S  2000  9853000
1  S  2005   976000
2  S  2010    96000
3  B  2005   365500
4  B  2020   765000

In [ ]:
df2=pd.DataFrame(
    np.arange(12).reshape((6,2)),
    index=[['B','B','S','S','S','S'],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['데이터1','데이터2'])
df2

        데이터1  데이터2
B 2000     0     1
  2005     2     3
S 2000     4     5
  2005     6     7
  2010     8     9
  2015    10    11

In [ ]:
pd.merge(df1, df2, left_on=['도시','연도'],right_index=True)

  도시    연도       인구  데이터1  데이터2
0  S  2000  9853000     4     5
1  S  2005   976000     6     7
2  S  2010    96000     8     9
3  B  2005   365500     2     3

In [ ]:
df1=pd.DataFrame(
    [[1.,2.], [3.,4.],[5.,6.]],
    index=['a','c','e'],
    columns=['S','B'])
df1

     S    B
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [ ]:
df2=pd.DataFrame(
    [[7., 8.], [9.,10.],[11.,12.],[13.,14.]],
    index=['b','c','d','e'],
    columns=['D', 'G'])

df2

      D     G
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [ ]:
pd.merge(df1, df2, how='outer', left_index=True, right_index=True)

     S    B     D     G
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [ ]:
df1.join(df2, how='outer')

     S    B     D     G
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [ ]:
s1=pd.Series([0,1],index=['A', 'B'])
s2=pd.Series([2,3,4], index=['A','B','C'])

In [ ]:
s1

A    0
B    1
dtype: int64

In [ ]:
s2

A    2
B    3
C    4
dtype: int64

In [ ]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [ ]:
df1=pd.DataFrame(
    np.arange(6).reshape(3,2),
    index=['a','b','c'],
    columns=['데이터1','데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [ ]:
df2=pd.DataFrame(
    np.arange(4).reshape(2,2),
    index=['a', 'c'],
    columns=['데이터3','데이터4'])
df2

   데이터3  데이터4
a     0     1
c     2     3

In [ ]:
pd.concat([df1, df2], axis=1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   0.0   1.0
b     2     3   NaN   NaN
c     4     5   2.0   3.0

In [ ]:
#피봇테이블
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns=["도시", "연도", "인구", "지역"]
df1=pd.DataFrame(data, columns= columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [ ]:
df1.pivot("도시", "연도", "인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [ ]:
df1.set_index(["도시", "연도"])[["인구"]].unstack()

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [ ]:
df1.pivot(["지역","도시"], "연도","인구")

연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN   263203.0  2890451.0

In [ ]:
#그룹분석(groupby)
np.random.seed(0)
df2=pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [ ]:
groups=df2.groupby(df2.key1)
groups

In [ ]:
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [ ]:
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [ ]:
df2.data1.groupby(df2.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [ ]:
df2.groupby(df2.key1).sum()["data1"]

key1
A    8
B    7
Name: data1, dtype: int64

In [ ]:
df2.data1.groupby([df2["key1"], df2["key2"]]).sum().unstack("key2")

key2  one  two
key1
A       6    2
B       3    4

In [ ]:
df1["인구"].groupby([df1["지역"],df1["연도"]]).sum().unstack("연도")

연도      2005     2010      2015
지역
경상권  3512547  3393191   3448737
수도권  9762546  9894685  12794763

In [ ]:
import seaborn as sns
iris = sns.load_dataset("iris")

In [ ]:
def peak_to_peak_ratio(x):
    return x.max()/ x.min()

iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [ ]:
iris.groupby(iris.species).describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [ ]:
#pivot table: groupby처럼 그룹분석을 하지만 최종적으로 피봇명령처럼 피봇테이블을 만듦
df1.pivot_table("인구", "도시", "연도")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [ ]:
df1.pivot_table("인구", "도시","연도", margins=True, margins_name='합계')

연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06

In [ ]:
df1.pivot_table("인구", index=["연도", "도시"])

              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451

In [ ]:
tips=sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [ ]:
tips['tip_pct']=tips['tip'] /tips['total_bill']
tips.tail()

     total_bill   tip     sex smoker   day    time  size   tip_pct
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

In [ ]:
tips.describe()

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345

In [ ]:
tips.groupby("sex").count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [ ]:
tips.groupby(["sex","smoker"]).size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [ ]:
tips

     total_bill   tip     sex smoker   day    time  size   tip_pct
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

In [ ]:
tips.pivot_table("tip_pct", "sex")

         tip_pct
sex
Male    0.157651
Female  0.166491

In [ ]:
tips.groupby("sex")[["tip_pct"]].describe()

       tip_pct                      ...
         count      mean       std  ...       50%       75%       max
sex                                 ...
Male     157.0  0.157651  0.064778  ...  0.153492  0.186240  0.710345
Female    87.0  0.166491  0.053632  ...  0.155581  0.194266  0.416667

[2 rows x 8 columns]

In [ ]:
#각 그룹에서 가장 많은 팁과 가장 적의 팁의 차이
def peak_to_peak(x):
  return x.max() -x.min()

tips.groupby(["sex", "smoker"])[["tip"]].agg(peak_to_peak)

                tip
sex    smoker
Male   Yes     9.00
       No      7.75
Female Yes     5.50
       No      4.20

In [ ]:
tips.groupby(["sex", "smoker"]).agg(
    {'tip_pct': 'mean', 'total_bill': peak_to_peak})

                tip_pct  total_bill
sex    smoker
Male   Yes     0.152771       43.56
       No      0.160669       40.82
Female Yes     0.182150       41.23
       No      0.156921       28.58

In [ ]:
tips.pivot_table(['tip_pct', 'size'], ['sex', 'day'],'smoker')

                 size             tip_pct
smoker            Yes        No       Yes        No
sex    day
Male   Thur  2.300000  2.500000  0.164417  0.165706
       Fri   2.125000  2.000000  0.144730  0.138005
       Sat   2.629630  2.656250  0.139067  0.162132
       Sun   2.600000  2.883721  0.173964  0.158291
Female Thur  2.428571  2.480000  0.163073  0.155971
       Fri   2.000000  2.500000  0.209129  0.165296
       Sat   2.200000  2.307692  0.163817  0.147993
       Sun   2.500000  3.071429  0.237075  0.165710

In [ ]:
tips.pivot_table('size', ['time','sex','smoker'], 'day',
                 aggfunc='sum', fill_value=0)

day                   Thur  Fri  Sat  Sun
time   sex    smoker
Lunch  Male   Yes       23    5    0    0
              No        50    0    0    0
       Female Yes       17    6    0    0
              No        60    3    0    0
Dinner Male   Yes        0   12   71   39
              No         0    4   85  124
       Female Yes        0    8   33   10
              No         2    2   30   43

In [ ]:
#시계열 자료다루기
#DatetimeIntex

date_str=["2018, 1,1", "2018, 1,4", "2018, 1,5","2018, 1,6"]
idx=pd.to_datetime(date_str)
idx

DatetimeIndex(['2018-01-01', '2018-01-04', '2018-01-05', '2018-01-06'], dtype='datetime64[ns]', freq=None)

In [ ]:
np.random.seed(0)
s= pd.Series(np.random.randn(4), index=idx)
s

2018-01-01    1.764052
2018-01-04    0.400157
2018-01-05    0.978738
2018-01-06    2.240893
dtype: float64

In [ ]:
pd.date_range("2018-4-1","2018-4-30")

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06', '2018-04-07', '2018-04-08',
               '2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12',
               '2018-04-13', '2018-04-14', '2018-04-15', '2018-04-16',
               '2018-04-17', '2018-04-18', '2018-04-19', '2018-04-20',
               '2018-04-21', '2018-04-22', '2018-04-23', '2018-04-24',
               '2018-04-25', '2018-04-26', '2018-04-27', '2018-04-28',
               '2018-04-29', '2018-04-30'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
pd.date_range(start="2018-4-1", periods=30)

In [ ]:
pd.date_range("2018-1-1","2018-12-31", freq="W-MON")

In [ ]:
np.random.seed(0)
ts=pd.Series(np.random.randn(4), index=pd.date_range(
    "2018-1-1", periods=4, freq="M"))
ts

2018-01-31    1.764052
2018-02-28    0.400157
2018-03-31    0.978738
2018-04-30    2.240893
Freq: M, dtype: float64

In [ ]:
ts= pd.Series(np.random.randn(100), index=pd.date_range("2018-1-1", periods=100, freq="D"))
ts.tail(20)

2018-03-22    1.488252
2018-03-23    1.895889
2018-03-24    1.178780
2018-03-25   -0.179925
2018-03-26   -1.070753
2018-03-27    1.054452
2018-03-28   -0.403177
2018-03-29    1.222445
2018-03-30    0.208275
2018-03-31    0.976639
2018-04-01    0.356366
2018-04-02    0.706573
2018-04-03    0.010500
2018-04-04    1.785870
2018-04-05    0.126912
2018-04-06    0.401989
2018-04-07    1.883151
2018-04-08   -1.347759
2018-04-09   -1.270485
2018-04-10    0.969397
Freq: D, dtype: float64

In [ ]:
ts.resample('W').mean()